                                             ASSIGNMENT: PANDAS ADVANCE 02

In [54]:
# Consider following code to answer further questions:

import pandas as pd

In [3]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [4]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

Q1. Write a code to print the data present in the second row of the dataframe, df.

In [14]:
df.head(1)

    course_name  duration
0  Data Science         2

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

 loc is primarily used for label indexing, while . iloc is mainly used for integer indexing

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].

In [7]:
new_df=df.reindex([3,0,1,2])

In [10]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [8]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [9]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

~~~~~~~~~~~~~~~~~~~~~~~~~~~~

In [1]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [2]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.619455  0.267688  0.975721  0.073399  0.305711  0.828547
2  0.999111  0.995725  0.259057  0.194775  0.895152  0.941032
3  0.322051  0.041064  0.871373  0.713474  0.375834  0.670407
4  0.640402  0.926962  0.141963  0.523287  0.560763  0.340467
5  0.291068  0.929366  0.299154  0.683703  0.292825  0.424350
6  0.929550  0.161572  0.001379  0.371859  0.968283  0.985200

Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’

In [3]:
df1.mean()

column_1    0.633606
column_2    0.553729
column_3    0.424775
column_4    0.426750
column_5    0.566428
column_6    0.698334
dtype: float64

In [4]:
df1.std()

column_1    0.295236
column_2    0.441406
column_3    0.401368
column_4    0.260476
column_5    0.299579
column_6    0.269097
dtype: float64

Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.

If you are getting errors in executing it then explain why.
.
-  [Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [7]:
#Replace the data from column2 by string
df1['column_2']= ['Mnnu', 'Sonu', 'Golu', 'papu', 'sheelu', 'Jivan']

In [8]:
df1

   column_1 column_2  column_3  column_4  column_5  column_6
1  0.619455     Mnnu  0.975721  0.073399  0.305711  0.828547
2  0.999111     Sonu  0.259057  0.194775  0.895152  0.941032
3  0.322051     Golu  0.871373  0.713474  0.375834  0.670407
4  0.640402     papu  0.141963  0.523287  0.560763  0.340467
5  0.291068   sheelu  0.299154  0.683703  0.292825  0.424350
6  0.929550    Jivan  0.001379  0.371859  0.968283  0.985200

In [9]:
df1.mean()

/tmp/ipykernel_102/2053335143.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.mean()

column_1    0.633606
column_3    0.424775
column_4    0.426750
column_5    0.566428
column_6    0.698334
dtype: float64

It is very certain then a mean is a mathematical opreation which can only apply in the numeric data as integer.Here we are applying the mean function to whole data frame so that where the int values are availble, function gives their output only.

Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

The window functions in Pandas are used to perform some sort of calculations across a set of rows that are interrelated with the current row.
Windows function in Pandas can be broadly divided into three categories namely- Aggregate, Ranking, and Value.

Q7. Write a code to print only the current month and year at the time of answering this question.
- [Hint: Use pandas.datetime function]

In [58]:
current_date = pd.datetime.now()
month = current_date.month
year = current_date.year

print("cureent month:", month)
print("current year:", year)

cureent month: 8
current year: 2023

/tmp/ipykernel_102/3066749790.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  current_date = pd.datetime.now()

Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.

In [39]:
import pandas as pd

date1 = input("Enter the first date (YYYY-MM-DD): ")
date2 = input("Enter the second date (YYYY-MM-DD): ")

date1 = pd.to_datetime(date1)
date2 = pd.to_datetime(date2)

delta = date2 - date1

print("Difference:")
print("Days:", delta.days)
print("Hours:", delta.seconds // 3600)
print("Minutes:", (delta.seconds // 60) % 60)

Enter the first date (YYYY-MM-DD):  2023-05-15
Enter the second date (YYYY-MM-DD):  2023-05-20

Difference:
Days: 5
Hours: 0
Minutes: 0

Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified
column to a categorical data type. The program should prompt the user to enter the file path, column
name, and category order, and then display the sorted data.

In [ ]:
# Prompt user for file path
file_path = input("Enter the file path: ")

# Prompt user for column name
column_name = input("Enter the column name: ")

# Prompt user for category order
category_order = input("Enter the category order (comma-separated): ").split(',')

# Read CSV file
df = pd.read_csv(file_path)

# Convert specified column to categorical data type
df[column_name] = pd.Categorical(df[column_name], categories=category_order, ordered=True)

# Sort the data by the specified column
sorted_df = df.sort_values(by=column_name)

# Display the sorted data
print(sorted_df)